HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxSbcu_bf.h
/**
 * \file IfxSbcu_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC38XA_UM_V1.0.0.R0
 * Specification: TC3xx User Manual V1.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Sbcu_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Sbcu_Registers
 * 
 */
#ifndef IFXSBCU_BF_H
#define IFXSBCU_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Sbcu_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_SBCU_ID_Bits.MOD_REV */
#define IFX_SBCU_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_SBCU_ID_Bits.MOD_REV */
#define IFX_SBCU_ID_MOD_REV_MSK (0xffu)

/** \brief Offset for Ifx_SBCU_ID_Bits.MOD_REV */
#define IFX_SBCU_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_SBCU_ID_Bits.MOD_NUMBER */
#define IFX_SBCU_ID_MOD_NUMBER_LEN (8u)

/** \brief Mask for Ifx_SBCU_ID_Bits.MOD_NUMBER */
#define IFX_SBCU_ID_MOD_NUMBER_MSK (0xffu)

/** \brief Offset for Ifx_SBCU_ID_Bits.MOD_NUMBER */
#define IFX_SBCU_ID_MOD_NUMBER_OFF (8u)

/** \brief Length for Ifx_SBCU_CON_Bits.TOUT */
#define IFX_SBCU_CON_TOUT_LEN (16u)

/** \brief Mask for Ifx_SBCU_CON_Bits.TOUT */
#define IFX_SBCU_CON_TOUT_MSK (0xffffu)

/** \brief Offset for Ifx_SBCU_CON_Bits.TOUT */
#define IFX_SBCU_CON_TOUT_OFF (0u)

/** \brief Length for Ifx_SBCU_CON_Bits.DBG */
#define IFX_SBCU_CON_DBG_LEN (1u)

/** \brief Mask for Ifx_SBCU_CON_Bits.DBG */
#define IFX_SBCU_CON_DBG_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_CON_Bits.DBG */
#define IFX_SBCU_CON_DBG_OFF (16u)

/** \brief Length for Ifx_SBCU_CON_Bits.SPC */
#define IFX_SBCU_CON_SPC_LEN (8u)

/** \brief Mask for Ifx_SBCU_CON_Bits.SPC */
#define IFX_SBCU_CON_SPC_MSK (0xffu)

/** \brief Offset for Ifx_SBCU_CON_Bits.SPC */
#define IFX_SBCU_CON_SPC_OFF (24u)

/** \brief Length for Ifx_SBCU_PRIOH_Bits.CPU2 */
#define IFX_SBCU_PRIOH_CPU2_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOH_Bits.CPU2 */
#define IFX_SBCU_PRIOH_CPU2_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOH_Bits.CPU2 */
#define IFX_SBCU_PRIOH_CPU2_OFF (0u)

/** \brief Length for Ifx_SBCU_PRIOH_Bits.CPU3 */
#define IFX_SBCU_PRIOH_CPU3_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOH_Bits.CPU3 */
#define IFX_SBCU_PRIOH_CPU3_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOH_Bits.CPU3 */
#define IFX_SBCU_PRIOH_CPU3_OFF (4u)

/** \brief Length for Ifx_SBCU_PRIOH_Bits.HSMRMI */
#define IFX_SBCU_PRIOH_HSMRMI_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOH_Bits.HSMRMI */
#define IFX_SBCU_PRIOH_HSMRMI_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOH_Bits.HSMRMI */
#define IFX_SBCU_PRIOH_HSMRMI_OFF (16u)

/** \brief Length for Ifx_SBCU_PRIOH_Bits.HSMCMI */
#define IFX_SBCU_PRIOH_HSMCMI_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOH_Bits.HSMCMI */
#define IFX_SBCU_PRIOH_HSMCMI_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOH_Bits.HSMCMI */
#define IFX_SBCU_PRIOH_HSMCMI_OFF (20u)

/** \brief Length for Ifx_SBCU_PRIOL_Bits.DMA */
#define IFX_SBCU_PRIOL_DMA_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOL_Bits.DMA */
#define IFX_SBCU_PRIOL_DMA_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOL_Bits.DMA */
#define IFX_SBCU_PRIOL_DMA_OFF (0u)

/** \brief Length for Ifx_SBCU_PRIOL_Bits.HSSL0 */
#define IFX_SBCU_PRIOL_HSSL0_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOL_Bits.HSSL0 */
#define IFX_SBCU_PRIOL_HSSL0_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOL_Bits.HSSL0 */
#define IFX_SBCU_PRIOL_HSSL0_OFF (12u)

/** \brief Length for Ifx_SBCU_PRIOL_Bits.CPU0 */
#define IFX_SBCU_PRIOL_CPU0_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOL_Bits.CPU0 */
#define IFX_SBCU_PRIOL_CPU0_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOL_Bits.CPU0 */
#define IFX_SBCU_PRIOL_CPU0_OFF (24u)

/** \brief Length for Ifx_SBCU_PRIOL_Bits.CPU1 */
#define IFX_SBCU_PRIOL_CPU1_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOL_Bits.CPU1 */
#define IFX_SBCU_PRIOL_CPU1_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOL_Bits.CPU1 */
#define IFX_SBCU_PRIOL_CPU1_OFF (28u)

/** \brief Length for Ifx_SBCU_ECON_Bits.ERRCNT */
#define IFX_SBCU_ECON_ERRCNT_LEN (14u)

/** \brief Mask for Ifx_SBCU_ECON_Bits.ERRCNT */
#define IFX_SBCU_ECON_ERRCNT_MSK (0x3fffu)

/** \brief Offset for Ifx_SBCU_ECON_Bits.ERRCNT */
#define IFX_SBCU_ECON_ERRCNT_OFF (0u)

/** \brief Length for Ifx_SBCU_ECON_Bits.TOUT */
#define IFX_SBCU_ECON_TOUT_LEN (1u)

/** \brief Mask for Ifx_SBCU_ECON_Bits.TOUT */
#define IFX_SBCU_ECON_TOUT_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ECON_Bits.TOUT */
#define IFX_SBCU_ECON_TOUT_OFF (14u)

/** \brief Length for Ifx_SBCU_ECON_Bits.RDY */
#define IFX_SBCU_ECON_RDY_LEN (1u)

/** \brief Mask for Ifx_SBCU_ECON_Bits.RDY */
#define IFX_SBCU_ECON_RDY_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ECON_Bits.RDY */
#define IFX_SBCU_ECON_RDY_OFF (15u)

/** \brief Length for Ifx_SBCU_ECON_Bits.ABT */
#define IFX_SBCU_ECON_ABT_LEN (1u)

/** \brief Mask for Ifx_SBCU_ECON_Bits.ABT */
#define IFX_SBCU_ECON_ABT_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ECON_Bits.ABT */
#define IFX_SBCU_ECON_ABT_OFF (16u)

/** \brief Length for Ifx_SBCU_ECON_Bits.ACK */
#define IFX_SBCU_ECON_ACK_LEN (2u)

/** \brief Mask for Ifx_SBCU_ECON_Bits.ACK */
#define IFX_SBCU_ECON_ACK_MSK (0x3u)

/** \brief Offset for Ifx_SBCU_ECON_Bits.ACK */
#define IFX_SBCU_ECON_ACK_OFF (17u)

/** \brief Length for Ifx_SBCU_ECON_Bits.SVM */
#define IFX_SBCU_ECON_SVM_LEN (1u)

/** \brief Mask for Ifx_SBCU_ECON_Bits.SVM */
#define IFX_SBCU_ECON_SVM_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ECON_Bits.SVM */
#define IFX_SBCU_ECON_SVM_OFF (19u)

/** \brief Length for Ifx_SBCU_ECON_Bits.WRN */
#define IFX_SBCU_ECON_WRN_LEN (1u)

/** \brief Mask for Ifx_SBCU_ECON_Bits.WRN */
#define IFX_SBCU_ECON_WRN_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ECON_Bits.WRN */
#define IFX_SBCU_ECON_WRN_OFF (20u)

/** \brief Length for Ifx_SBCU_ECON_Bits.RDN */
#define IFX_SBCU_ECON_RDN_LEN (1u)

/** \brief Mask for Ifx_SBCU_ECON_Bits.RDN */
#define IFX_SBCU_ECON_RDN_MSK (0x1u)

